package lesson_67.wait_notify;

public class Main {

    /*
    Wait - notify

    wait() -   заставляет поток ждать неограниченное время пока другой поток не вызовет на том же обьекте метод
                notify()  или  notifyAll()

      wait( long time) -   заставляет поток ждать  время time пока другой поток не вызовет на том же обьекте метод
                notify()  или  notifyAll()

      notify() -  служит для того, чтобы "разбудить" один из ждущих доступа к монитору потоков
      notifyAll() -  "будит " все ждущие потоки.
     */
}
